{
    "architectures": ["MixtralForCausalLM"],
    "model_type": "mixtral",
    "vocab_size": 32000,
    "hidden_size": 256,
    "intermediate_size": 512,
    "num_attention_heads": 8,
    "num_hidden_layers": 4,
    "num_key_value_heads": 4,
    "hidden_act": "silu",
    "max_position_embeddings": 4096,
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-5,
    "use_cache": true,
    "pad_token_id": 0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "tie_word_embeddings": false,
    "rope_theta": 10000.0,
    "sliding_window": 4096,
    "attention_dropout": 0.0,
    "num_experts_per_tok": 2,
    "num_local_experts": 8
}
