{
    "architectures": ["Phi3ForCausalLM"],
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "gelu_new",
    "hidden_dropout": 0.0,
    "hidden_size": 512,
    "initializer_range": 0.02,
    "intermediate_size": 2048,
    "layer_norm_eps": 1e-05,
    "max_position_embeddings": 256,
    "model_type": "phi3",
    "num_attention_heads": 8,
    "num_hidden_layers": 6,
    "num_key_value_heads": 4,
    "pad_token_id": 0,
    "position_embedding_type": "yarn",
    "rotary_base": 500000,
    "rotary_scaling": {
        "factor": 2.0,
        "original_max_position_embeddings": 256,
        "type": "yarn"
    },
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.48.0.dev0",
    "use_cache": true,
    "vocab_size": 51200
}
